export default {
  register: {
    title: "ลงทะเบียนล่วงหน้า",
    subtitle: "กรุณากรอกข้อมูลให้ครบถ้วน",
    submit: "ลงทะเบียน",
    invalidIdNumber: "เลขประจำตัวประชาชนไม่ถูกต้อง",
    dialog: {
      title: "กรุณาตรวจสอบข้อมูลให้แน่ใจก่อนยืนยัน",
      cancel: "แก้ไข",
      ok: "ยืนยัน"
    },
    success: {
      title: "ลงทะเบียนสำเร็จ",
      subtitle: "พบกันวันงาน ที่สแตนด์จุฬานะคะ!",
      backtohome: "กลับหน้าแรก",
      checkinfo: "ตรวจสอบข้อมูล"
    }
  },
  fullname: "ชื่อ-นามสกุล",
  idNumber: "เลขประจำตัวประชาชน",
  phoneNumber: "เบอร์โทรศัพท์",
  email: "อีเมล",
  required: "โปรดระบุ{{name}}",
  invalidValue: "{{name}}ไม่ถูกต้อง",
  faculty: "คณะ",
  facultyNames: {
    "01": "01 สถาบันภาษาไทยสิรินธร",
    "02": "02 ศูนย์การศึกษาทั่วไป",
    "20": "20 บัณฑิตวิทยาลัย",
    "21": "21 คณะวิศวกรรมศาสตร์",
    "22": "22 คณะอักษรศาสตร์",
    "23": "23 คณะวิทยาศาสตร์",
    "24": "24 คณะรัฐศาสตร์",
    "25": "25 คณะสถาปัตยกรรมศาสตร์",
    "26": "26 คณะพาณิชยศาสตร์และการบัญชี",
    "27": "27 คณะครุศาสตร์",
    "28": "28 คณะนิเทศศาสตร์",
    "29": "29 คณะเศรษฐศาสตร์",
    "30": "30 คณะแพทยศาสตร์",
    "31": "31 คณะสัตวแพทยศาสตร์",
    "32": "32 คณะทันตแพทยศาสตร์",
    "33": "33 คณะเภสัชศาสตร์",
    "34": "34 คณะนิติศาสตร์",
    "35": "35 คณะศิลปกรรมศาสตร์",
    "36": "36 คณะพยาบาลศาสตร์",
    "37": "37 คณะสหเวชศาสตร์",
    "38": "38 คณะจิตวิทยา",
    "39": "39 คณะวิทยาศาสตร์การกีฬา",
    "40": "40 สำนักวิชาทรัพยากรการเกษตร",
    "51": "51 วิทยาลัยประชากรศาสตร์",
    "53": "53 วิทยาลัยวิทยาศาสตร์สาธารณสุข",
    "55": "55 สถาบันภาษา",
    "56": "56 สถาบันนวัตกรรมบูรณาการ",
    "58": "58 สถาบันบัณฑิตบริหารธุรกิจ ศศินทร์ฯ",
    "99": "99 บุคคลภายนอกหรือนิสิตเก่า"
  }
}
