export default {
  appname: "งานฟุตบอลประเพณี จุฬาฯ-ธรรมศาสตร์ ครั้งที่ 74",
  register: {
    title: "ลงทะเบียนล่วงหน้า",
    subtitle: "กรุณากรอกข้อมูลให้ครบถ้วน",
    submit: "ลงทะเบียน",
    back: "กลับหน้าหลัก",
    invalidIdNumber: "เลขประจำตัวประชาชนไม่ถูกต้อง",
    backtohome: "กลับหน้าแรก",
    checkinfo: "ตรวจสอบข้อมูล",
    dialog: {
      title: "กรุณาตรวจสอบข้อมูลให้แน่ใจก่อนยืนยัน",
      cancel: "แก้ไข",
      ok: "ยืนยัน"
    },
    success: {
      title: "ลงทะเบียนสำเร็จ",
      subtitle: "พบกันวันงาน ที่สแตนด์จุฬานะคะ!",
    },
    duplicate: {
      title: "ลงทะเบียนไว้อยู่แล้ว",
      desc: "เลขประจำตัวประชาชนนี้ใช้ลงทะเบียนแล้ว หากต้องการแก้ไขข้อมูลการลงทะเบียน โปรดไปที่หน้า<1>ตรวจสอบข้อมูล</1>",
      again: "ลงทะเบียนอีกครั้ง",
    }
  },
  fullname: "ชื่อ-นามสกุล",
  idNumber: "เลขประจำตัวประชาชน",
  phoneNumber: "เบอร์โทรศัพท์",
  email: "อีเมล",
  required: "โปรดระบุ{{name}}",
  invalidValue: "{{name}}ไม่ถูกต้อง",
  faculty: "คณะ",
  facultyNames: {
    "99": "บุคคลภายนอกหรือนิสิตเก่า",
    "01": "สถาบันภาษาไทยสิรินธร",
    "02": "ศูนย์การศึกษาทั่วไป",
    "20": "บัณฑิตวิทยาลัย",
    "21": "คณะวิศวกรรมศาสตร์",
    "22": "คณะอักษรศาสตร์",
    "23": "คณะวิทยาศาสตร์",
    "24": "คณะรัฐศาสตร์",
    "25": "คณะสถาปัตยกรรมศาสตร์",
    "26": "คณะพาณิชยศาสตร์และการบัญชี",
    "27": "คณะครุศาสตร์",
    "28": "คณะนิเทศศาสตร์",
    "29": "คณะเศรษฐศาสตร์",
    "30": "คณะแพทยศาสตร์",
    "31": "คณะสัตวแพทยศาสตร์",
    "32": "คณะทันตแพทยศาสตร์",
    "33": "คณะเภสัชศาสตร์",
    "34": "คณะนิติศาสตร์",
    "35": "คณะศิลปกรรมศาสตร์",
    "36": "คณะพยาบาลศาสตร์",
    "37": "คณะสหเวชศาสตร์",
    "38": "คณะจิตวิทยา",
    "39": "คณะวิทยาศาสตร์การกีฬา",
    "40": "สำนักวิชาทรัพยากรการเกษตร",
    "51": "วิทยาลัยประชากรศาสตร์",
    "53": "วิทยาลัยวิทยาศาสตร์สาธารณสุข",
    "55": "สถาบันภาษา",
    "56": "สถาบันนวัตกรรมบูรณาการ",
    "58": "สถาบันบัณฑิตบริหารธุรกิจ ศศินทร์ฯ"
  },
  facultySearch: "ค้นหาชื่อคณะ",
  login: {
    title: "ตรวจสอบข้อมูลการลงทะเบียน",
    subtitle: "ตรวจสอบข้อมูลที่คุณได้กรอกไป",
    submit: "ตรวจสอบ",
    wrongCredentials: "เลขประจำตัวประชาชนหรือเบอร์โทรศัพท์ไม่ถูกต้อง",
  },
  random: {
    current: "เลขที่ออก",
    previous: "เลขก่อนหน้า",
  },
  noMatch: {
    title: "ไม่พบเพจ",
    subtitle: "เราไม่พบเพจที่คุณหาอยู่",
    returnHome: "กลับหน้าหลัก",
  },
  back: "ย้อนกลับ",
  scanqr: {
    title:"แสกน QR code",
    title2:"ณ จุดลงทะเบียน",
    subtitle:"แผนที่จุดลงทะเบียน"
  },
  userdata: {
    title:"ข้อมูลของคุณ",
    contact1:"หากมีข้อมูลผิดพลาด กรุณาแจ้งที่",
    contact2:"<Email or Some Link>",
    contact3:"เพื่อแก้ไข",
    back:"กลับหน้าหลัก"
  },
  admin: {
    register:"ลงทะเบียน", 
    enter:"เข้างาน",
    person:"คน"
  },
  error: "เกิดข้อผิดพลาด",
  ok: "ตกลง",
  logout: "ออกจากระบบ"
}
